# ========================================================================
#
# Brewfile
#
# This file is part of tomkyle/dotfiles
# <https://github.com/tomkyle/dotfiles>
#
# ========================================================================


tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

### Mac App Store CLI
### Requires Xcode.app 10.1 which itself
### requires something newer than my macOS 10.11
# brew "mas"

# Shell stuff
brew "zsh"
brew "bash"
brew "bash-completion"
brew "ssh-copy-id"
brew "awk"
brew "openssh"
brew "coreutils"
brew "findutils"
brew "lnav"
brew "ncdu"
brew "tree"


###  File mangling
brew "ack"
brew "the_silver_searcher"
brew "curl"
brew "wget"
brew "remarshal"
brew "cless"

### Possibly useful one day
# brew "jp"
# brew "jsonpp"
# brew "shyaml"
# brew "mycli"


### Editors
brew "micro"
brew "nano"


### Development
brew "git"
brew "git-flow-avh"
brew "git-open"
brew "tig"
brew "ruby"
brew "php"
brew "composer"
brew "shellcheck"




### Imagery
brew "exiftool"
brew "webp"
brew "openimageio"
brew "imagemagick"
brew "graphicsmagick"
brew "dcraw"
brew "exiv2"
brew "parallel"



### Apps
# cask "quiver" # does not exist?!
cask "bitwarden"
cask "iterm2"
cask "sublime-text"
cask "transmit"
cask "sequel-pro"
cask "typora"
cask "firefox", args: {"language": "de"}
cask "google-chrome"
cask "google-backup-and-sync"
cask "evernote"
cask "nextcloud"
cask "libreoffice"
cask "libreoffice-language-pack", args: {"language": "de"}
cask "skype"
cask "slack"
cask "adobe-creative-cloud"


### Quick Look plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "webpquicklook"
cask "quicklook-json"
cask "quicklook-csv"


### Fonts
cask "font-office-code-pro"
cask "font-lato"
cask "font-hack"
cask "font-work-sans"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-slab"
cask "font-roboto-condensed"
cask "font-noto-sans"
cask "font-noto-mono"
cask "font-noto-serif"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-inter"


